#+PROPERTY: header-args:python :session man :exports both :results output replace :cache no  
#+TITLE: kolaBiBot Manual
#+AUTHOR: M. Kone / Codex
#+DATE: 2026-05-12
#+OPTIONS: toc:2 num:nil


* Overview

- This file lists the main command-line entry points implemented in this repo.
- Default focus is Kraken Futures.
- Use =--environment demo= for the demo platform and =--environment live= for the live platform.
- Active trade entry points now live under =kolabi.bargain/=.
- If a command fails because of a symbol, first list instruments with:
  - =python -m kolabi.bargain.cli --symbol PI_XBTUSD --environment demo instruments=
- Standard order intents currently covered by the Kraken contract:
  - =Limit=
  - =Market=
  - =StopLoss= or trigger-entry market
  - =StopLossLimit= or trigger-entry limit
  - =TakeProfit= or market-if-touched
  - =TakeProfitLimit= or limit-if-touched
  - =TrailingStop= native Kraken trailing stop
  - =TrailingStopLimit= native Kraken trailing stop limit
- In this repo, order placement is currently done through Kraken Futures REST.
- Websockets are currently used here for public market data and private account/order state, not for placing Futures orders.

#+BEGIN_SRC bash  -i
python -m kolabi.bargain.cli --symbol PI_XBTUSD --environment demo instruments
#+END_SRC

#+RESULTS:
| Synbol           | futures_inverse  |
|------------------+------------------|
| PI_XBTUSD        | futures_inverse  |
| PI_ETHUSD        | futures_inverse  |
| PI_XRPUSD        | futures_inverse  |
| PI_LTCUSD        | futures_inverse  |
| PI_BCHUSD        | futures_inverse  |
| PF_XBTUSD        | flexible_futures |
| PF_AVAXUSD       | flexible_futures |
| PF_DOTUSD        | flexible_futures |
| FF_XBTUSD_260626 | flexible_futures |
| PF_ADAUSD        | flexible_futures |
| FF_ETHUSD_260626 | flexible_futures |
| PF_ATOMUSD       | flexible_futures |
| PF_EOSUSD        | flexible_futures |
| PF_SOLUSD        | flexible_futures |
| PF_ETHUSD        | flexible_futures |
| PF_BCHUSD        | flexible_futures |
| PF_LINKUSD       | flexible_futures |
| PF_UNIUSD        | flexible_futures |
| PF_LTCUSD        | flexible_futures |
| PF_XRPUSD        | flexible_futures |
| PF_XMRUSD        | flexible_futures |
| PF_DEFIUSD       | flexible_futures |
| PF_FILUSD        | flexible_futures |
| PF_MATICUSD      | flexible_futures |
| PF_LUNA2USD      | flexible_futures |
| PF_OPUSD         | flexible_futures |
| PF_APEUSD        | flexible_futures |
| PF_NEARUSD       | flexible_futures |
| PF_WAVESUSD      | flexible_futures |
| PF_AAVEUSD       | flexible_futures |
| PF_CRVUSD        | flexible_futures |
| PF_MANAUSD       | flexible_futures |
| PF_ALGOUSD       | flexible_futures |
| PF_SNXUSD        | flexible_futures |
| PF_XLMUSD        | flexible_futures |
| PF_XTZUSD        | flexible_futures |
| PF_TRXUSD        | flexible_futures |
| PF_FTMUSD        | flexible_futures |
| PF_DOGEUSD       | flexible_futures |
| PF_GMTUSD        | flexible_futures |
| PF_YFIUSD        | flexible_futures |
| PF_COMPUSD       | flexible_futures |
| PF_ENJUSD        | flexible_futures |
| PF_SANDUSD       | flexible_futures |
| PF_APTUSD        | flexible_futures |
| PF_GRTUSD        | flexible_futures |
| PF_CHZUSD        | flexible_futures |
| PF_LPTUSD        | flexible_futures |
| PF_BATUSD        | flexible_futures |
| PF_AXSUSD        | flexible_futures |
| PF_GALAUSD       | flexible_futures |
| PF_ETCUSD        | flexible_futures |
| PF_KAVAUSD       | flexible_futures |
| PF_LRCUSD        | flexible_futures |
| PF_KSMUSD        | flexible_futures |
| PF_FLOWUSD       | flexible_futures |
| PF_ZECUSD        | flexible_futures |
| PF_QTUMUSD       | flexible_futures |
| PF_DASHUSD       | flexible_futures |
| PF_1INCHUSD      | flexible_futures |
| PF_KNCUSD        | flexible_futures |
| PF_OGNUSD        | flexible_futures |
| PF_SUSHIUSD      | flexible_futures |
| PF_GMXUSD        | flexible_futures |
| PF_ARBUSD        | flexible_futures |
| PF_LDOUSD        | flexible_futures |
| PF_PEPEUSD       | flexible_futures |
| PF_SHIBUSD       | flexible_futures |
| FF_ETHUSD_260515 | flexible_futures |
| FF_XBTUSD_260515 | flexible_futures |
| FF_XBTUSD_260925 | flexible_futures |
| FF_ETHUSD_260925 | flexible_futures |
| FF_XBTUSD_260529 | flexible_futures |
| FF_ETHUSD_260529 | flexible_futures |


** Preamble

#+begin_src python
from kolabi.shared.config import load_exchange_config
from kolabi.shared.exchanges import get_adapter

config = load_exchange_config(
    "kraken",
    symbol="PI_XBTUSD",
    environment="demo",
)

Adapter = get_adapter("kraken")
adapter = Adapter(
    api_key=config.api_key,
    api_secret=config.api_secret,
    base_url=config.base_url,
    symbol=config.symbol,
    **config.adapter_kwargs,
)
#+end_src

#+RESULTS:

** Read Data

#+begin_src python
print(adapter.list_instruments()[:5])
print(adapter.validate_symbol("PI_XBTUSD"))
print(adapter.get_balance())
print(adapter.get_position())
#+end_src

#+RESULTS:
: [{'symbol': 'PI_XBTUSD', 'type': 'futures_inverse', 'underlying': 'rr_xbtusd', 'tickSize': 0.5, 'contractSize': 1, 'tradeable': True, 'impactMidSize': 1000.0, 'maxPositionSize': 5000000.0, 'openingDate': '2019-02-27T13:49:16Z', 'marginLevels': [{'contracts': 0, 'initialMargin': 0.02, 'maintenanceMargin': 0.01}], 'fundingRateCoefficient': 24, 'maxRelativeFundingRate': 0.0025, 'isin': 'PI_XBTUSD', 'contractValueTradePrecision': 0, 'postOnly': False, 'feeScheduleUid': 'd46c2190-81e3-4370-a333-424f24387829', 'mtf': True, 'base': 'BTC', 'quote': 'USD', 'pair': 'BTC:USD', 'retailMarginLevels': [{'contracts': 0, 'initialMargin': 0.02, 'maintenanceMargin': 0.01}], 'marginSchedules': {}, 'category': '', 'tags': [], 'tradfi': False}, {'symbol': 'PI_ETHUSD', 'type': 'futures_inverse', 'underlying': 'rr_ethusd', 'tickSize': 0.025, 'contractSize': 1, 'tradeable': True, 'impactMidSize': 1000.0, 'maxPositionSize': 2000000.0, 'openingDate': '2019-03-05T10:07:17Z', 'marginLevels': [{'contracts': 0, 'initialMargin': 0.02, 'maintenanceMargin': 0.01}], 'fundingRateCoefficient': 24, 'maxRelativeFundingRate': 0.0025, 'contractValueTradePrecision': 0, 'postOnly': False, 'feeScheduleUid': 'd46c2190-81e3-4370-a333-424f24387829', 'mtf': False, 'base': 'ETH', 'quote': 'USD', 'pair': 'ETH:USD', 'retailMarginLevels': [{'contracts': 0, 'initialMargin': 0.02, 'maintenanceMargin': 0.01}], 'marginSchedules': {}, 'category': '', 'tags': [], 'tradfi': False}, {'symbol': 'PI_XRPUSD', 'type': 'futures_inverse', 'underlying': 'rr_xrpusd', 'tickSize': 0.0001, 'contractSize': 1, 'tradeable': True, 'impactMidSize': 1000.0, 'maxPositionSize': 3000000.0, 'openingDate': '2019-03-05T10:07:55Z', 'marginLevels': [{'contracts': 0, 'initialMargin': 0.02, 'maintenanceMargin': 0.01}], 'fundingRateCoefficient': 24, 'maxRelativeFundingRate': 0.0025, 'contractValueTradePrecision': 0, 'postOnly': False, 'feeScheduleUid': 'd46c2190-81e3-4370-a333-424f24387829', 'mtf': False, 'base': 'XRP', 'quote': 'USD', 'pair': 'XRP:USD', 'retailMarginLevels': [{'contracts': 0, 'initialMargin': 0.02, 'maintenanceMargin': 0.01}], 'marginSchedules': {}, 'category': '', 'tags': [], 'tradfi': False}, {'symbol': 'PI_LTCUSD', 'type': 'futures_inverse', 'underlying': 'rr_ltcusd', 'tickSize': 0.01, 'contractSize': 1, 'tradeable': True, 'impactMidSize': 1000.0, 'maxPositionSize': 2000000.0, 'openingDate': '2019-03-05T10:08:23Z', 'marginLevels': [{'contracts': 0, 'initialMargin': 0.02, 'maintenanceMargin': 0.01}], 'fundingRateCoefficient': 24, 'maxRelativeFundingRate': 0.0025, 'contractValueTradePrecision': 0, 'postOnly': False, 'feeScheduleUid': 'd46c2190-81e3-4370-a333-424f24387829', 'mtf': False, 'base': 'LTC', 'quote': 'USD', 'pair': 'LTC:USD', 'retailMarginLevels': [{'contracts': 0, 'initialMargin': 0.02, 'maintenanceMargin': 0.01}], 'marginSchedules': {}, 'category': '', 'tags': [], 'tradfi': False}, {'symbol': 'PI_BCHUSD', 'type': 'futures_inverse', 'underlying': 'rr_bchusd', 'tickSize': 0.1, 'contractSize': 1, 'tradeable': True, 'impactMidSize': 200.0, 'maxPositionSize': 2000000.0, 'openingDate': '2019-03-05T10:34:12Z', 'marginLevels': [{'contracts': 0, 'initialMargin': 0.02, 'maintenanceMargin': 0.01}], 'fundingRateCoefficient': 24, 'maxRelativeFundingRate': 0.0025, 'contractValueTradePrecision': 0, 'postOnly': False, 'feeScheduleUid': 'd46c2190-81e3-4370-a333-424f24387829', 'mtf': False, 'base': 'BCH', 'quote': 'USD', 'pair': 'BCH:USD', 'retailMarginLevels': [{'contracts': 0, 'initialMargin': 0.02, 'maintenanceMargin': 0.01}], 'marginSchedules': {}, 'category': '', 'tags': [], 'tradfi': False}]
: {'symbol': 'PI_XBTUSD', 'type': 'futures_inverse', 'underlying': 'rr_xbtusd', 'tickSize': 0.5, 'contractSize': 1, 'tradeable': True, 'impactMidSize': 1000.0, 'maxPositionSize': 5000000.0, 'openingDate': '2019-02-27T13:49:16Z', 'marginLevels': [{'contracts': 0, 'initialMargin': 0.02, 'maintenanceMargin': 0.01}], 'fundingRateCoefficient': 24, 'maxRelativeFundingRate': 0.0025, 'isin': 'PI_XBTUSD', 'contractValueTradePrecision': 0, 'postOnly': False, 'feeScheduleUid': 'd46c2190-81e3-4370-a333-424f24387829', 'mtf': True, 'base': 'BTC', 'quote': 'USD', 'pair': 'BTC:USD', 'retailMarginLevels': [{'contracts': 0, 'initialMargin': 0.02, 'maintenanceMargin': 0.01}], 'marginSchedules': {}, 'category': '', 'tags': [], 'tradfi': False}
: 20168.05190074529
: Position(symbol='PI_XBTUSD', qty=100.0, entry_price=80671.5)

CLI equivalents:

#+begin_example
python -m kolabi.bargain.cli --symbol PI_XBTUSD --environment demo instruments
python -m kolabi.bargain.cli --symbol PI_XBTUSD --environment demo check-symbol
python -m kolabi.bargain.cli --symbol PI_XBTUSD --environment demo balance
python -m kolabi.bargain.cli --symbol PI_XBTUSD --environment demo position
#+end_example

** Send Orders
# These blocks send real orders to Kraken Futures demo.

#+begin_src python
# Limit order
ack = adapter.place_order(side="buy", orderQty=2, price=70000, type_="LIMIT")
print(ack)

# Market order
ack = adapter.place_order(side="buy", orderQty=1, type_="MARKET")
print(ack)

# Cancel order
ack = adapter.cancel_order("YOUR_ORDER_ID")
print(ack)

# Amend order
ack = adapter.amend_order("YOUR_ORDER_ID", price=70500)
print(ack)
#+end_src

* bargain.cli
#+BEGIN_SRC bash :results output
python -m kolabi.bargain.cli --help
#+END_SRC

#+RESULTS:
#+begin_example
usage: python -m kolabi.bargain.cli [-h] [--symbol SYMBOL]
                                    [--environment {demo,live}]
                                    {balance,position,instruments,check-symbol,cancel,amend,open-orders,trigger-orders,cancel-all,close-all,limit,market,trailing,trailing-limit} ...

positional arguments:
  {balance,position,instruments,check-symbol,cancel,amend,open-orders,trigger-orders,cancel-all,close-all,limit,market,trailing,trailing-limit}

options:
  -h, --help            show this help message and exit
  --symbol SYMBOL
  --environment {demo,live}
#+end_example

- Command: =python -m kolabi.bargain.cli=
- Role: direct exchange-adapter CLI for instruments, balance, position, order submission, amend, and cancel
- Global options:
  - =--exchange {kraken,binance,bitmex}= : exchange adapter target, default =kraken=
  - =--market-type {futures,spot,margin,isolated_margin}= : exchange market lane, default =futures=
  - =--symbol= : native exchange symbol. If omitted, the route default follows =--exchange= and =--market-type=: Kraken futures =PI_XBTUSD=, Kraken spot/margin =XBT/USD=, Binance lanes =BTCUSDT=, BitMEX futures =XBTUSD=, BitMEX spot =XBT_USDT=
  - =--environment {demo,live}= : selected endpoint family

| Command          | Purpose                                | Main options                                          |
|------------------+----------------------------------------+-------------------------------------------------------|
| =routes=         | list route codes, defaults, credential env names, and key/secret presence without connecting | none                                                  |
| =balance=        | read available margin                  | none                                                  |
| =position=       | read current position                  | none                                                  |
| =permissions=    | check no-order API key order-write permission when the adapter supports it | none                                                  |
| =instruments=    | list Futures instruments               | =--contains=                                          |
| =check-symbol=   | verify the selected product id         | none                                                  |
| =limit=          | send one limit order                   | =--side=, =--qty=, =--price=                          |
| =market=         | send one market order                  | =--side=, =--qty=                                     |
| =cancel=         | cancel one order                       | =--order-id=                                          |
| =amend=          | amend one order                        | =--order-id=, =--price=, =--qty=                      |
| =trailing=       | send native Kraken trailing stop       | =--side=, =--qty=, =--deviation=, =--unit=            |
| =trailing-limit= | send native Kraken trailing stop limit | =--side=, =--qty=, =--price=, =--deviation=, =--unit= |

Help behavior:
- =python -m kolabi.bargain.cli --help= shows one-line descriptions for each subcommand.
- =python -m kolabi.bargain.cli <subcommand> --help= shows that subcommand description and options.
- Example: =python -m kolabi.bargain.cli balance --help= describes the balance read command.

The =routes= command reports =permission_probe=, =order_write_probe=, and =demo_requires_base_url_override= for each lane. Binance spot/futures can prove order-write with a no-order =test_order= endpoint. BitMEX can read =apiKey= metadata, but order-write still depends on the returned permission list. Kraken spot/margin and Binance margin demo lanes require an explicit market-capable demo base URL before adapter construction.

Examples:

#+begin_src bash
  python -m kolabi.bargain.cli --environment demo routes
  python -m kolabi.bargain.cli --exchange bitmex --market-type futures --environment demo permissions
  python -m kolabi.bargain.cli --exchange kraken --symbol PI_XBTUSD --environment demo balance
  python -m kolabi.bargain.cli --exchange kraken --symbol PI_XBTUSD --environment demo position
  python -m kolabi.bargain.cli --exchange kraken --symbol PI_XBTUSD --environment demo instruments --contains ADA
  python -m kolabi.bargain.cli --exchange kraken --symbol PF_ADAUSD --environment demo check-symbol
  # orders
  python -m kolabi.bargain.cli --exchange kraken --symbol PI_XBTUSD --environment demo limit --side buy --qty 2 --price 70000
  python -m kolabi.bargain.cli --exchange kraken --symbol PI_XBTUSD --environment demo market --side buy --qty 1
  python -m kolabi.bargain.cli --exchange kraken --symbol PI_XBTUSD --environment demo cancel --order-id YOUR_ORDER_ID
  python -m kolabi.bargain.cli --exchange kraken --symbol PI_XBTUSD --environment demo amend --order-id YOUR_ORDER_ID --price 70100 --qty 3
  python -m kolabi.bargain.cli --exchange kraken --symbol PI_XBTUSD --environment demo trailing \
    --side buy --qty 1 --deviation 20 --unit PERCENT
  python -m kolabi.bargain.cli --exchange kraken --symbol PI_XBTUSD --environment demo trailing-limit \
    --side buy --qty 1 --price 82000 --deviation 20 --unit PERCENT
#+end_src

* bargain.smoke

- Command: =python -m kolabi.bargain.smoke=
- Role: place a paced sweep of standard Kraken Futures order kinds
- Use: demo validation of the contract layer and order serializers
- Main options:
  - =--exchange {kraken,binance,bitmex}= : exchange target, default =kraken=
  - =--market-type {futures,spot,margin,isolated_margin}= : exchange market lane, default =futures=
  - =--symbol= : native exchange symbol. If omitted, the route default follows =--exchange= and =--market-type=
  - =--environment {demo,live}=
  - =--list-orders= : print tested/supported smoke order plan for the exchange and exit
  - =--only ORDER_NAME= : submit only one named smoke order; repeat or comma-separate names. Use =--only limit_below= for the first safe submit-and-cancel demo probe
  - =--sleep-seconds=: use =2= or more to stay conservative
  - =--log-level=

#+begin_src bash  :results output
python -m kolabi.bargain.smoke --help 
#+end_src

#+RESULTS:
#+begin_example
usage: python -m kolabi.bargain.smoke [-h]
                                      [--exchange {kraken,binance,bitmex}]
                                      [--symbol SYMBOL]
                                      [--environment {demo,live}]
                                      [--sleep-seconds SLEEP_SECONDS]
                                      [--log-level LOG_LEVEL]

options:
  -h, --help            show this help message and exit
  --exchange {kraken,binance,bitmex}
  --symbol SYMBOL
  --environment {demo,live}
  --sleep-seconds SLEEP_SECONDS
  --log-level LOG_LEVEL
#+end_example

* DB kolabidb helper
#+BEGIN_SRC bash  -i
scripts/kolabidb public start --pair PI_XBTUSD

scripts/kolabidb private start --account-scope default

scripts/kolabidb private start --account-scope advers --api-key-env KRKF_DEMO2_API_KEY --api-secret-env KRKF_DEMO2_API_SECRET

scripts/kolabidb private status --account-scope advers
scripts/kolabidb private logs --account-scope advers
#+END_SRC

* PostgreSQL local DB lanes

- PostgreSQL is the default =kolabidb= backend.
- The host already has =postgres:16= available.
- The compose file uses =127.0.0.1:15433= to avoid the existing Tusis PostgreSQL on =127.0.0.1:15432=.
- PostgreSQL files live under =dbs/postgres= so local DB state is visible under the repo-local =dbs= directory.
- Main and adversarial accounts use separate private, critical, audit, and telemetry databases.
- Both accounts share the public market database.

Pros of storing PostgreSQL under =dbs/postgres=:
- It is easy to inspect, back up, and reset.
- It matches the repo-local DB helper mental model.
- It keeps all local DB state out of the project root.

Cons:
- Docker no longer owns the storage as an opaque named volume.
- Host file ownership may show the Postgres container UID.
- Manual deletion is easier, so =dbs/postgres/= is ignored by Git.

Prepare the local PostgreSQL environment file before starting the container. The file feeds both Docker Compose interpolation and the Kolabi host commands:

#+begin_src bash
cp docker/postgres/kolabi-postgres.env.example .env.postgres
set -a
. ./.env.postgres
set +a
#+end_src

The local =.env.postgres= file is ignored by Git. If you change the local PostgreSQL password, URL-encode special characters before placing them in =KOLABI_PG=.

Start PostgreSQL:

#+begin_src bash
docker-compose -f docker-compose.postgres.yml up -d
docker-compose -f docker-compose.postgres.yml ps
#+end_src

Reset the local PostgreSQL files only when you want a disposable fresh DB:

#+begin_src bash
docker-compose -f docker-compose.postgres.yml down
rm -rf dbs/postgres
mkdir -p dbs/postgres
docker-compose -f docker-compose.postgres.yml up -d
#+end_src

Use the helper when you want background feeders. Feeder logs still live under =./logs=; container logs come from the =postgres= target:

#+begin_src bash
scripts/kolabidb postgres start
scripts/kolabidb postgres status
scripts/kolabidb postgres logs
scripts/kolabidb public start --pair PI_XBTUSD
scripts/kolabidb private start
scripts/kolabidb private start --account-scope advers --api-key-env KRKF_DEMO2_API_KEY --api-secret-env KRKF_DEMO2_API_SECRET
scripts/kolabidb public logs
scripts/kolabidb private logs
#+end_src

Start the shared public market feeder:

#+begin_src bash
python -m kolabi.tree.kraken run \
  --pair PI_XBTUSD \
  --environment demo \
  --db-url "$KOLABI_MARKET_DB_URL" \
  --private-db-url "$KOLABI_ACCOUNT_DB_URL"
#+end_src

Start the main private account feeder:

#+begin_src bash
python -m kolabi.tree.account run \
  --environment demo \
  --account-scope default \
  --account-db-url "$KOLABI_ACCOUNT_DB_URL" \
  --critical-db-url "$KOLABI_CRITICAL_DB_URL"
#+end_src

Start the adversarial private account feeder:

#+begin_src bash
python -m kolabi.tree.account run \
  --environment demo \
  --account-scope advers \
  --account-db-url "$KOLABI_ADVERS_ACCOUNT_DB_URL" \
  --critical-db-url "$KOLABI_ADVERS_CRITICAL_DB_URL" \
  --api-key-env KRKF_DEMO2_API_KEY \
  --api-secret-env KRKF_DEMO2_API_SECRET
#+end_src

Run the main bot against PostgreSQL:

#+begin_src bash
python -m kolabi.bot run \
  --strategy orders/rep_xbt.tsv \
  --exchange kraken \
  --symbol PI_XBTUSD \
  --environment demo \
  --market-db-url "$KOLABI_MARKET_DB_URL" \
  --account-db-url "$KOLABI_ACCOUNT_DB_URL" \
  --critical-db-url "$KOLABI_CRITICAL_DB_URL" \
  --audit-db-url "$KOLABI_AUDIT_DB_URL" \
  --telemetry-db-url "$KOLABI_TELEMETRY_DB_URL"
#+end_src

Run the adversarial bot against PostgreSQL:

#+begin_src bash
python -m kolabi.bot run \
  --strategy orders/advers.tsv \
  --exchange kraken \
  --symbol PI_XBTUSD \
  --environment demo \
  --account-scope advers \
  --market-db-url "$KOLABI_MARKET_DB_URL" \
  --account-db-url "$KOLABI_ADVERS_ACCOUNT_DB_URL" \
  --critical-db-url "$KOLABI_ADVERS_CRITICAL_DB_URL" \
  --audit-db-url "$KOLABI_ADVERS_AUDIT_DB_URL" \
  --telemetry-db-url "$KOLABI_ADVERS_TELEMETRY_DB_URL" \
  --api-key-env KRKF_DEMO2_API_KEY \
  --api-secret-env KRKF_DEMO2_API_SECRET
#+end_src

Check readiness with PostgreSQL:

#+begin_src bash
python -m kolabi.bot preflight \
  --exchange kraken \
  --symbol PI_XBTUSD \
  --environment demo \
  --market-db-url "$KOLABI_MARKET_DB_URL" \
  --account-db-url "$KOLABI_ACCOUNT_DB_URL" \
  --critical-db-url "$KOLABI_CRITICAL_DB_URL"
#+end_src


#+BEGIN_SRC bash  :results output
scripts/kolabidb -h
#+END_SRC

#+RESULTS:
#+begin_example
Usage:
  scripts/kolabidb [--dry-run] public   start|status|stop|reload|logs [options]
  scripts/kolabidb [--dry-run] private  start|status|stop|reload|logs [options]
  scripts/kolabidb [--dry-run] postgres start|status|stop|reload|logs [options]

Targets:
  public      Kraken public market-data DB feeder, one DB per instrument.
  private     Kraken private account/order DB feeder. Reuses the public DB by default.
  postgres    Local PostgreSQL container from docker-compose.postgres.yml.

Actions:
  start       Start the selected feeder in the background.
  status      Print PID/log status for the selected feeder.
  stop        Stop the selected feeder. TERM first, then KILL after the timeout.
  reload      Stop then start. This is a restart; the Python feeders have no live reload.
  logs        Tail the selected feeder log from ./logs.

Public options:
  --pair SYMBOL                 Native exchange symbol. Kraken default: PI_XBTUSD. Binance default: BTCUSDT.
                                BitMEX default: XBTUSD for futures, XBT_USDT for spot.
  --environment demo|live       Kraken endpoint family. Default: demo.
  --db-url URL                  Public DB URL override. Default comes from the selected backend.
  --private-db-url URL          Private DB URL used by the public feeder for correlation.

Private options:
  --account-scope NAME          Logical account/persona label stored with private rows.
                                Default: default. Example: advers for the adversarial account.
  --account-db-url URL          Private account DB URL override. Default comes from the selected backend.
  --critical-db-url URL         Critical open_orders/fills DB URL. Default follows account DB naming.
  --allow-critical-forensic-prune
                                Allow retention pruning of critical open_orders/fills raw events and ingest audits.
                                Default: disabled, so critical lifecycle evidence is shielded.
  --api-key-env NAME            Environment variable containing the Kraken API key.
  --api-secret-env NAME         Environment variable containing the Kraken API secret.
  --public reuse|spawn          For private start/reload, reuse existing public DB feeder or start one too.
                                Default: reuse.

Common options:
  --backend postgres           DB lane defaults to use for public/private feeders. Default: postgres.
  --postgres                   Shortcut for --backend postgres.
  --env-file PATH              PostgreSQL env file loaded for feeders and the postgres target.
                               Default: .env.postgres.
  --log-level LEVEL             Python log level. Default: INFO.
  --tail-lines N                Lines printed before following logs. Default: 80.
  --stop-timeout-seconds N      Grace seconds before KILL on stop. Default: 10.
  -h, --help                    Show this help and exit.

Examples:
  scripts/kolabidb public start --pair PI_XBTUSD
  scripts/kolabidb private start
  scripts/kolabidb postgres logs
  scripts/kolabidb private start --account-scope advers --api-key-env KRKF_DEMO2_API_KEY --api-secret-env KRKF_DEMO2_API_SECRET
  scripts/kolabidb private start --public spawn --pair PI_XBTUSD

Systemctl-shaped equivalents:
  scripts/kolabidb public status      # like: systemctl --user status kolabidb-public-postgres-demo-PI_XBTUSD
  scripts/kolabidb public stop        # like: systemctl --user stop   kolabidb-public-postgres-demo-PI_XBTUSD
  scripts/kolabidb private logs       # like: journalctl --user -u    kolabidb-private-postgres-demo-default -f
#+end_example

** tree.kraken public db

- Command: =python -m kolabi.tree.kraken=
- Role: public Kraken Futures market-data DB service (orderbook snapshots and indicators)
- Data persisted: market snapshots, derived indicators, service health

| Subcommand | Purpose                                                    |
|------------+------------------------------------------------------------|
| =run=      | start continuous public websocket listener and DB writer   |
| =probe=    | run listener for bounded seconds, then print status        |
| =status=   | show public DB counts and stream status                    |

Shared options:

| Option                             | Meaning                                   |
|------------------------------------+-------------------------------------------|
| =--pair=                           | Futures product id, for example PI_XBTUSD |
| =--environment {demo,live}=        | endpoint family                           |
| =--db-url=                         | public PostgreSQL DB URL |
| =--private-db-url=                 | private DB location used for correlation  |
| =--ws-url=                         | override public websocket URL             |
| =--trace-ws=                       | print websocket payload traces            |
| =--trace-ws-format {compact,json}= | trace output format                       |
| =--snapshot-interval-seconds=      | snapshot write cadence                    |
| =--indicator-interval-seconds=     | indicator write cadence                   |
| =--log-interval-seconds=           | service heartbeat cadence                 |

Examples:

#+begin_src bash
python -m kolabi.tree.kraken run --environment demo --pair PI_XBTUSD
python -m kolabi.tree.kraken probe --environment demo --pair PI_XBTUSD --seconds 15 --trace-ws
python -m kolabi.tree.kraken status --environment demo --pair PI_XBTUSD
#+end_src

** tree.account private db

- Command: =python -m kolabi.tree.account=
- Role: private Kraken Futures account/order state service
- Data persisted: orders, fills, balances, positions, margin fields, connection health

| Subcommand  | Purpose                                      |
|-------------+----------------------------------------------|
| =run=       | start private websocket listener             |
| =reconcile= | fetch one private REST snapshot and store it |
| =status=    | show private DB counts and stream status     |

Shared options:

| Option                      | Meaning                                 |
|-----------------------------+-----------------------------------------|
| =--account-db-url=          | private PostgreSQL DB URL               |
| =--critical-db-url=         | critical open_orders/fills DB location  |
| =--exchange=                | exchange label stored in DB             |
| =--environment {demo,live}= | endpoint family                         |
| =--market-type=             | market label stored in DB               |
| =--account-scope=           | logical account scope                   |
| =--allow-critical-forensic-prune= | permit retention pruning of critical raw/audit lifecycle evidence |
| =--ws-url=                  | override private websocket URL          |
| =--rest-url=                | override private REST base URL          |
| =--api-key-env=             | API key environment variable            |
| =--api-secret-env=          | API secret environment variable         |
| =--stream-kind=             | stream label for connection health rows |

Examples:

#+begin_src bash
python -m kolabi.tree.account run --environment demo
python -m kolabi.tree.account reconcile --environment demo
python -m kolabi.tree.account status --environment demo
#+end_src

* kolabidb helper

- Command: =scripts/kolabidb=
- Role: repo-local helper for starting and stopping public/private DB feeders in the background, plus local PostgreSQL container control
- Logs: all helper-managed processes append to =./logs/kolabidb-*.log=
- PostgreSQL container logs: =scripts/kolabidb postgres logs=
- Runtime PIDs: helper state lives under =.run/kolabidb/=

#+begin_example
Usage:
  scripts/kolabidb [--dry-run] public   start|status|stop|reload|logs [options]
  scripts/kolabidb [--dry-run] private  start|status|stop|reload|logs [options]
  scripts/kolabidb [--dry-run] postgres start|status|stop|reload|logs [options]
#+end_example

Important options:

| Option                    | Meaning |
|---------------------------+---------|
| =-h, --help=              | print helper usage and examples |
| =--backend postgres=       | choose PostgreSQL lane defaults; default is PostgreSQL |
| =--env-file=              | PostgreSQL env file, default =.env.postgres= |
| =--pair=                  | instrument for public DB naming, for example =PI_XBTUSD= |
| =--public reuse\vert spawn= | private start reuses an existing public feeder by default; =spawn= starts one too |
| =--account-scope=         | logical private account/persona label, for example =default= or =advers= |
| =--account-db-url=        | explicit private DB URL |
| =--critical-db-url=       | explicit critical private DB URL |
| =--api-key-env=           | environment variable name containing the API key |
| =--api-secret-env=        | environment variable name containing the API secret |

Examples:

#+begin_src bash
scripts/kolabidb public start --pair PI_XBTUSD
scripts/kolabidb private start
scripts/kolabidb private start --public spawn --pair PI_XBTUSD
scripts/kolabidb private start --account-scope advers --api-key-env KRKF_DEMO2_API_KEY --api-secret-env KRKF_DEMO2_API_SECRET
scripts/kolabidb private status
scripts/kolabidb private logs
scripts/kolabidb private stop
scripts/kolabidb postgres start
scripts/kolabidb postgres logs
#+end_src

* bot run
#+BEGIN_SRC bash :results output
  python -m kolabi.bot run --help
#+END_SRC  

#+RESULTS:
#+begin_example
usage: kolabi.bot run [-h] --strategy STRATEGY [--exchange EXCHANGE]
                      [--symbol SYMBOL] [--environment {demo,live}]
                      [--db-url DB_URL] [--market-db-url MARKET_DB_URL]
                      [--account-db-url ACCOUNT_DB_URL]
                      [--ready-timeout-seconds READY_TIMEOUT_SECONDS]
                      [--ready-poll-seconds READY_POLL_SECONDS]
                      [--max-public-age-seconds MAX_PUBLIC_AGE_SECONDS]
                      [--max-private-age-seconds MAX_PRIVATE_AGE_SECONDS]
                      [--max-reconcile-age-seconds MAX_RECONCILE_AGE_SECONDS]
                      [--skip-ready-check] [--log-level LOG_LEVEL]
                      [--update-pause UPDATE_PAUSE] [--log-pause LOG_PAUSE]
                      [--sync] [--dry-run]

options:
  -h, --help            show this help message and exit
  --strategy, -s STRATEGY
                      Path to Org strategy table file (e.g. orders/demo_ada.tsv)
  --exchange EXCHANGE
  --symbol SYMBOL
  --environment {demo,live}
  --db-url DB_URL       Optional database URL for run persistence
  --market-db-url MARKET_DB_URL
                        Optional public market data DB URL. Defaults from
                        Kraken Futures environment.
  --account-db-url ACCOUNT_DB_URL
                        Optional private account DB URL. Defaults from Kraken
                        Futures environment.
  --ready-timeout-seconds READY_TIMEOUT_SECONDS
                        Maximum wait for fresh Kraken public/private state
                        before the strategy loop starts.
  --ready-poll-seconds READY_POLL_SECONDS
                        Polling cadence used while waiting for Kraken runtime
                        readiness.
  --max-public-age-seconds MAX_PUBLIC_AGE_SECONDS
                        Maximum acceptable age for the public market snapshot.
  --max-private-age-seconds MAX_PRIVATE_AGE_SECONDS
                        Maximum acceptable age for the private websocket
                        heartbeat.
  --max-reconcile-age-seconds MAX_RECONCILE_AGE_SECONDS
                        Maximum acceptable age for the startup REST reconcile.
  --skip-ready-check    Skip Kraken runtime freshness checks before starting
                        the strategy.
  --log-level LOG_LEVEL
  --update-pause UPDATE_PAUSE
  --log-pause LOG_PAUSE
  --sync                Run orders synchronously (blocking) instead of
                        spawning threads
  --dry-run             Parse the strategy file and print orders without
                        submitting them
#+end_example

*** Examples:

#+begin_src bash
python -m kolabi.bot run --strategy orders/xbt_bk.tsv --exchange kraken --symbol PI_XBTUSD --environment demo --dry-run

python -m kolabi.bot run --strategy orders/xbt_bk.tsv --exchange kraken --symbol PI_XBTUSD --environment demo
#+end_src

*** Capturing run logs

- Bot strategy commands write to the terminal by default; there is no automatic strategy log file for =python -m kolabi.bot run= or =python -m kolabi.bot run-once=.
- To keep a live copy while still seeing the output, redirect stderr to stdout and pipe through =tee=:

#+begin_src bash
python -m kolabi.bot run --strategy orders/stra.tsv --exchange kraken --symbol PI_XBTUSD --environment demo 2>&1 | tee logs/stra.log
#+end_src

- Replace =logs/stra.log= with the strategy-specific file you want, for example =logs/bmm_ada.log=.
- Default background DB feeder logs are created by =scripts/kolabidb= under =./logs/kolabidb-*.log=; inspect them with =scripts/kolabidb public logs=, =scripts/kolabidb private logs=, or =scripts/kolabidb postgres logs=.

*** Reporting terminated pairs

=scripts/kolabi-run-report= turns a captured runtime log into an aligned Org table for terminated head/tail pairs. It reads lifecycle timing and amendment events from the log, then reads local account DB fill rows for exact head/tail fill prices, fees, and maker/taker roles. The command does not call the exchange.

#+begin_src bash
scripts/kolabi-run-report logs/krf_ada.log
scripts/kolabi-run-report logs/krf_ada.log -o JOURNAL.org
#+end_src

By default the command resolves =KOLABI_ACCOUNT_DB_URL= from the environment or from =.env.postgres=. Pass =--account-db-url= to use another private account DB. Use =--log-only= only when DB rows are unavailable; in that mode fill prices are the rounded values seen in runtime logs and DB-only columns such as maker/taker, net, and cumulative net can be blank.

The report columns are:

- =H fill UTC= and =T fill UTC=: head and tail fill times in UTC, formatted as =MM-DD HH:MM=.
- =Life=: elapsed time from head fill to tail fill.
- =Pair=: pair name plus right-aligned attempt count.
- =h/t side=: abbreviated head/tail sides, for example =S/B= or =B/S=.
- =Hfill=, =Tfill=, and =Qty=: DB-backed fill price and quantity when DB rows are available.
- =H/T liq=: maker/taker roles, abbreviated =M= or =T=.
- =A#=, =T amend1 UTC=, =T amend2 UTC=, and =A.diff=: tail amendment count, first two amend times, and final amended stop minus initial tail stop. =A.diff= is a quote-price difference per base unit, for example USD/ADA on =PF_ADAUSD=; it is not multiplied by =Qty=. Terminal =0.0000= stop placeholders in close updates are ignored so they do not erase the last real amend price.
- =Gross USD=, =Net USD=, and =Cum net=: gross before fees, net after DB fees when fee rows are in USD-like currency, and running cumulative net.

Useful options:

#+begin_example
--account-db-url URL  Use a specific local account DB.
--env-file PATH      Read KOLABI_ACCOUNT_DB_URL from another env file.
--log-only           Build a best-effort table from logs only.
--output, -o PATH    Write the Org table to a file.
--price-dp N         Decimal places for Hfill and Tfill.
#+end_example

** bot run-once
#+BEGIN_SRC bash :results output
  python -m kolabi.bot run-once --help
#+END_SRC

#+RESULTS:
#+begin_example
usage: kolabi.bot run [-h] --strategy STRATEGY [--exchange EXCHANGE]
                      [--symbol SYMBOL]
                      [--market-type {futures,spot,margin,isolated_margin}]
                      [--environment {demo,live}] [--dry-run] [--simulate]
                      [--max-active-pairs MAX_ACTIVE_PAIRS]
                      [--rest-min-interval REST_MIN_INTERVAL]
                      [--rest-max-inflight REST_MAX_INFLIGHT]

selected options:
  --strategy, -s STRATEGY
                        Path to Org strategy table file, for example orders/demo_ada.tsv.
  --exchange EXCHANGE   Default exchange for rows without an exchg value.
  --symbol SYMBOL       Default exchange product id for rows without a symbol value.
  --market-type         Default market lane for strategy rows without an exchange route code.
  --dry-run             Plan the strategy through Dragon/Chronos/Isis/Horus without calling Ogun.
  --simulate            Run the async supervisor path with simulated execution and confirmations.
#+end_example

** bot preflight
#+BEGIN_SRC bash :results output
python -m kolabi.bot preflight --help
#+END_SRC   

#+RESULTS:
#+begin_example
usage: kolabi.bot preflight [-h] [--exchange EXCHANGE] [--symbol SYMBOL]
                            [--market-type {futures,spot,margin,isolated_margin}]
                            [--strategy STRATEGY]
                            [--environment {demo,live}]
                            [--base-url BASE_URL]
                            [--market-db-url MARKET_DB_URL]
                            [--account-db-url ACCOUNT_DB_URL]
                            [--critical-db-url CRITICAL_ACCOUNT_DB_URL]
                            [--account-scope ACCOUNT_SCOPE]
                            [--api-key-env API_KEY_ENV]
                            [--api-secret-env API_SECRET_ENV]
                            [--ready-timeout-seconds READY_TIMEOUT_SECONDS]
                            [--ready-poll-seconds READY_POLL_SECONDS]
                            [--max-public-age-seconds MAX_PUBLIC_AGE_SECONDS]
                            [--max-private-age-seconds MAX_PRIVATE_AGE_SECONDS]
                            [--max-reconcile-age-seconds MAX_RECONCILE_AGE_SECONDS]

options:
  -h, --help            show this help message and exit
  --exchange EXCHANGE   Exchange name. (default: kraken)
  --symbol SYMBOL       Exchange product id. Default follows --exchange and
                        --market-type.
  --market-type {futures,spot,margin,isolated_margin}
                        Default market lane for strategy rows without an exchange
                        route code. (default: futures)
  --strategy STRATEGY   Optional Org strategy table; checks every
                        exchange/symbol route in the file. (default: None)
  --environment {demo,live}
                        Endpoint family. (default: demo)
  --base-url BASE_URL, --rest-url BASE_URL
                        REST base URL override for the default exchange/market
                        route. (default: None)
  --market-db-url MARKET_DB_URL
                        Optional public market data DB URL. Defaults from
                        selected exchange environment. (default: None)
  --account-db-url ACCOUNT_DB_URL
                        Optional private account DB URL. Defaults from
                        selected exchange environment. (default: None)
  --critical-db-url CRITICAL_ACCOUNT_DB_URL
                        Optional critical private DB URL for order/fill
                        lifecycle. Defaults from selected exchange
                        environment. (default: None)
  --account-scope ACCOUNT_SCOPE
                        Logical account/persona label for scoped private DB
                        env lanes. (default: default)
  --api-key-env API_KEY_ENV
                        Environment variable name containing the exchange API
                        key. Use this to preflight the same account selected
                        by run/run-once. (default: None)
  --api-secret-env API_SECRET_ENV
                        Environment variable name containing the exchange API
                        secret. Use this to preflight the same account
                        selected by run/run-once. (default: None)
  --ready-timeout-seconds READY_TIMEOUT_SECONDS
                        Maximum wait for readiness checks. (default: 45.0)
  --ready-poll-seconds READY_POLL_SECONDS
                        Polling cadence while waiting for readiness. (default:
                        1.0)
  --max-public-age-seconds MAX_PUBLIC_AGE_SECONDS
                        Maximum acceptable age of public market snapshot.
                        (default: 15.0)
  --max-private-age-seconds MAX_PRIVATE_AGE_SECONDS
                        Maximum acceptable age of private websocket heartbeat.
                        (default: 30.0)
  --max-reconcile-age-seconds MAX_RECONCILE_AGE_SECONDS
                        Maximum acceptable age of REST reconcile snapshot.
                        (default: 300.0)
#+end_example

# Need to centralize this in the doc direclty

- Command: =python -m kolabi.bot preflight=
- Role: check whether exchange route credentials and public/private DB state are ready enough to start an Org strategy table
- Output: reports =credentials_ready=, =base_urls_ready=, and =route_config_ready=; base URL fields report only source names such as =override= or an env var name, not the URL value

Options:

| Option                        | Meaning                                |
|-------------------------------+----------------------------------------|
| =--exchange=                  | exchange name                          |
| =--symbol=                    | native exchange symbol; default follows exchange and market type |
| =--strategy=                  | optional Org strategy table; checks every route in the file |
| =--environment {demo,live}=   | endpoint family                        |
| =--base-url=                  | REST base URL override for the default exchange/market route |
| =--market-db-url=             | public market DB override              |
| =--account-db-url=            | private account DB override            |
| =--api-key-env=               | API key environment variable used for the default route |
| =--api-secret-env=            | API secret environment variable used for the default route |
| =--ready-timeout-seconds=     | displayed timeout budget for operators |
| =--ready-poll-seconds=        | polling cadence                        |
| =--max-public-age-seconds=    | public market freshness threshold      |
| =--max-private-age-seconds=   | private websocket freshness threshold  |
| =--max-reconcile-age-seconds= | REST reconcile freshness threshold     |

* Typical Sequences

** Discover Products

#+begin_src bash
python -m kolabi.bargain.cli --environment demo --symbol PI_XBTUSD  instruments
python -m kolabi.bargain.cli --environment demo --symbol PI_XBTUSD  instruments --contains ADA
python -m kolabi.bargain.cli --environment demo --symbol PI_ADAUSD  check-symbol
#+end_src

** Check Services

#+begin_src bash
python -m kolabi.tree.kraken probe --environment demo --pair PI_XBTUSD --seconds 15 --trace-ws
python -m kolabi.tree.account status --environment demo
#+end_src

** Start the DB in different shells
#+BEGIN_SRC bash
  # Shell 1: start the public Kraken Futures market DB service:
  python -m kolabi.tree.kraken run --pair PI_XBTUSD --environment demo
  # Shell 2: start the private account/order DB service:
  python -m kolabi.tree.account run --environment demo
  # Shell 3: check readiness against both DBs:
  python -m kolabi.bot preflight --exchange kraken --symbol PI_XBTUSD --environment demo  
  python -m kolabi.bot preflight --exchange binance --market-type spot --environment demo --api-key-env BINS_DEMO_API_KEY --api-secret-env BINS_DEMO_API_SECRET
  python -m kolabi.bot preflight --exchange binance --market-type margin --environment demo --base-url https://margin-demo.example.test --api-key-env BINM_DEMO_API_KEY --api-secret-env BINM_DEMO_API_SECRET
#+END_SRC   
** Send And Cancel One Demo Order

#+begin_src bash
python -m kolabi.bargain.cli --environment demo --symbol PI_XBTUSD  limit --side buy --qty 2 --price 70000
python -m kolabi.bargain.cli --environment demo --symbol PI_XBTUSD  cancel --order-id YOUR_ORDER_ID
#+end_src

** Test a more complicated order with a Tail
#+begin_src bash
python -m kolabi.bot run-once --symbol PI_XBTUSD --environment demo -m XSellTail -t 0 1440 -O 60 -x 'D1 2' --hPrice D1 --qty A1 --tPrice %0.5 -o L -y S- -c sell --dry-run

python -m kolabi.bot run-once --symbol PI_XBTUSD --environment demo -m XPct -t 0 60 -x '%-1 1' --hPrice %0.5 --qty A1 --tPrice %0.5 -o L -y S- -c buy --dry-run

python -m kolabi.bot run-once --symbol PI_XBTUSD --environment demo -m XAbs -t 0 60 -x 'A79320 79340' --hPrice A79350 --qty A1 --tPrice D0.5 -o L -y S- -c sell --dry-run
#+end_src



** Run Strategy

#+begin_src bash
    python -m kolabi.tree.kraken run --environment demo --pair PI_XBTUSD
    python -m kolabi.tree.account run --environment demo
    python -m kolabi.bot preflight --environment demo --exchange kraken --symbol PI_XBTUSD
    python -m kolabi.bot run --strategy orders/xbt_bk.tsv --exchange kraken --symbol PI_XBTUSD --environment demo
#+end_src
